Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: Firewalls könnten uns stören und was, wenn wir gar keine Berechtigung für eine Serverkonsole haben.
pl: Mogłyby nam stanąć na przeszkodzie firewalls, nie wspominając już o braku uprawnień do konsoli.

source: Folgen wir dem Pfad der differierenden SHA1-Hash-Werte, finden wir die verstümmelte Datei, wie auch den 'Commit', in dem sie erstmals auftauchte.
pl: Wystrarczy teraz prześledzić ścieżkę różniących się kluczy SHA1, odnajeźć okaleczony plik, jak i 'commit' w którym po raz pierwszy wystąpił.

source: Folglich ist standardmäßig das 'Pushen' per Git-Protokoll verboten.
pl: Przy ustawieniach standardowych polecenie PUSH za pomocą protokołu GIT jest zdeaktywowane.

source: Fortgeschrittenes Rückgängig machen/Wiederherstellen
pl: Zaawansowane usuwanie/przywracanie

source: François Marier unterhält das Debian Packet, das ursprünglich von Daniel Baumann erstellt wurde.
pl: François Marier jest mentorem pakietu Debiana, który uprzednio utworzony został przez Daniela Baumann.

source: Früher nutzte jedes Projekt eine zentralisierte Versionsverwaltung.
pl: Kiedyś każdy projekt korzystał z własnego scentralizowanego systemu kontroli wersji.

source: Führe *git add* aus um sie hinzuzufügen und dann die vorhergehende Anweisung.
pl: Wykonak *git add*, by go dodać a następnie poprzedzającą instrukcje.

source: Führe die Anweisungen des anderen Versionsverwaltungssystems aus, die nötig sind um die Dateien ins zentrale 'Repository' zu übertragen.
pl: Wykonaj konieczne kroki opisane w innym systemie, by przekazać dane do centralnego składu.

source: Für Git Hostingdienste folge den Anweisungen zum Erstellen des zunächst leeren Git 'Repository'.
pl: Jeśli korzystasz z hosting to poszukaj wskazówek utwożemia najpierw pustego REPOSITORY

source: Für die 'Commits' A und B, hängt die Bedeutung der Ausdrücke "A..B" und "A...B" davon ab, ob eine Anweisung zwei Endpunkte erwartet oder einen Bereich.
pl: Dla 'commits' A i B, znaczenie wyrażeń "A..B" i "A...B" zależy od tego, czy polecenie oczekuje dwóch punktów końcowych, czy zakresu.

source: Für diese Anleitung hätte ich vielleicht am Anfang des *pre-commit* 'hook' folgendes hinzugefügt, zum Schutz vor Zerstreutheit:
pl: Na początku *pre-commit* tego 'hook' umieściłbym dla ochrony przed rozdrobnieniem:

source: Für diesen Punkt ist unsere Computerspielanalogie ungeeignet.
pl: Do przedstawienia tego punktu wykorzystanie analogii do gier komputerowych nie jest odpowiednia.

source: Für ein Closed-Source-Projekt lasse die 'touch' Anweisung weg und stelle sicher, dass niemals eine Datei namens `git-daemon-export-ok` erstellt wird.
pl: Przy projektach Closed-Source nie używaj polecenia TOUCH i upewnij się, że nigdy nie zostanie utworzony plik o nazwie git-daemon-export-ok

source: Für eine vernünftigere Erklärung siehe http://de.wikipedia.org/wiki/Versionsverwaltung[den Wikipedia Artikel zur Versionsverwaltung].
pl: Dla bardziej rozsądnego wyjaśnienia przeczytajcie http://pl.wikipedia.org/wiki/System_kontroli_wersji[Artykół Wikipedii na temat systemu kontroli wersji].

source: Für jede Änderung, die Du gemacht hast, zeigt Git Dir die Codepassagen, die sich geändert haben und fragt ob sie Teil des nächsten 'Commit' sein sollen.
pl: Dla każdej zmiany, której dokonałeś GIT pokaże ci pasaże z kodem, który uległ zmianom i spyta cię, czy mają zostać częścią następnego 'commit'.

source: Für jede überwachte Datei speichert Git Informationen wie deren Größe, ihren Erstellzeitpunkt und den Zeitpunkt der letzten Bearbeitung in einer Datei die wir als 'Index' kennen.
pl: Dla każdego kontrolowanego pliku, Git zapamiętuje informacje o jego wielkości, czasie utworzenia i czasie ostatniej edycji w pliku znanym nam jako index.

source: Für jetzt, merke dir
pl: zapamietaj jednak na razie, że:

source: Für meine Projekte bevorzuge ich es, wenn Unterstützer 'Repositories' vorbereiten, von denen ich 'pullen' kann.
pl: W moich projektach preferuję, gdy pomagający mi programiści przygotują własne repozytoria, z których mogę wykonać 'pull'.

source: Für reale Projekte solltest Du solche Anweisungen üblicherweise vermeiden, da Du dadurch Datensicherungen zerstörst.
pl: W prawdziwych projektach powinnaś unikać takich komend, poonieważ zniszczą zabezpieczone dane.

source: Für tiefer gehende Erklärungen verweise ich auf das http://www.kernel.org/pub/software/scm/git/docs/user-manual.html[englischsprachige Benutzerhandbuch].
pl: Dla pogłębienia tematu odsyłam na http://www.kernel.org/pub/software/scm/git/docs/user-manual.html[anielskojęzychny podręcznik użytkownika].

source: Gegründet und betrieben von einem der ersten Git Entwickler.
pl: Założona i uprawiana przez jednego z pierwszych deweloperów Git.

source: Geheime Quellen
pl: Utajnione Zródła

source: Gelegentlich brauchst du Versionsverwaltung vergleichbar dem Wegretuschieren von Personen aus einem offiziellen Foto, um diese in stalinistischer Art aus der Geschichte zu löschen.
pl: Czasami potrzebny ci rodzaj systemu zarządzania porównywalnego do wyretuszowania osób z oficjalnego zdjęcia, by w stalinistowski sposób wymazać je z historii.

source: Genau deswegen gibt es Releasezyklen.
pl: Właśnie dla tego istnieje coś takiego jak RELEASEZYKLEN.

source: Genauso wenig setzt das 'Clonen' des zentralen 'Repository' dessen Bedeutung herab.
pl: Tym samym klonowanie centralnego repozytorium nie umniejsza jego znaczenia.

source: Generell sollten Referenzen mit *git update-ref -d* gelöscht werden, auch wenn es gewöhnlich sicher ist +refs/original+ von Hand zu löschen.
pl: Generalnie do kasowania referencji powinnaś używać *git update-ref -d*, nawet gdy ręczne usunięcie +ref/original+ jest dość bezpieczne.

source: Geschichte machen
pl: Tworzyć historię

source: Geschichtsstunde
pl: Lekcja historii

source: Gewagte Kunststücke
pl: Śmiałe wyczyny

source: Gib ein:
pl: Za pomoc

source: Git benutzt den Rückgabewert der übergebenen Anweisung, normalerweise ein Skript für einmalige Ausführung, um zu entscheiden, ob eine Änderung gut ('good') oder schlecht ('bad') ist: Das Skript sollte 0 für 'good' zurückgeben, 125 wenn die Änderung übersprungen werden soll und irgendetwas zwischen 1 und 127 für 'bad'.
pl: Git korzysta tutaj z wartości zwróconej przez skrypt, by ocenić czy zmiana jest dobra ('good'), czy zła ('bad'): Skrypt powinien zwracać 0 dla 'good', 128, jeśli zmiana powinna być pominięta, i coś pomiędzy 1 - 127 dla 'bad'.

source: Git benutzt hierzu die Abkürzung *git mv*, welche die gleiche Syntax wie *mv* hat.
pl: GIT korzysta tu ze skrotu *git mv*, ktory posiada ten sam syntax co polecenie *mv*

source: Git für Fortgeschrittene
pl: Git dla zaawansowanych

source: Git hat mir bewundernswert gedient und hat mich bis jetzt noch nie im Stich gelassen.
pl: Git służył mi znakomicie i jak na razoiie jeszcze nigdy mnie nie zawiódł.

source: Git ist 'assoziativ': Dateien werden nicht nach Ihren Namen gespeichert, sondern eher nach dem SHA1-Hash-Wert der Daten, welche sie enthalten, in einer Datei, die wir als 'Blob'-Objekt bezeichnen.
pl: Git pracuje asocjacyjnie (skojarzeniowo): dane nie są zapamiętywane na podstawie ich nazwy, tylko wartości ich własnego klucza SHA1 w pliku, który określamy mianem objektu 'blob'.

source: Git kommt beim 'Commit' dazu sich um die Dateinamen zu kümmern:
pl: Podczas wykonywania 'commit' Git troszczy się o nazwy plików:

source: Git lässt dich genauso arbeiten, wie du es willst.
pl: GIT pozwoli ci pracować dokładnie tak jak chcesz.

source: Git löscht diese Dateien für dich, falls du es noch nicht getan hast.
pl: GIT usunie dane za ciebie, jesli tego jeszcze nie zrobiles.

source: Git mitzuteilen, welche Dateien man hinzugefügt, gelöscht und umbenannt hat, ist für manche Projekte sehr mühsam. Stattdessen kann man folgendes eingeben:
pl: Powiadomienie GIT o dodaniu, skasowaniu czy zmianie nazwy plików może okazać sie przy niektórych projektach dość uciążliwą pracą. Zamiast tego można skorzystać z:

source: Git referenziert Änderungen anhand ihres SHA1-Hash, was in vielen Fällen besser ist.
pl: Git natomiast odwołuje się przy zmianach do hasha SHA1, który w wielu przypadkach jest lepszym rozwiązaniem.

source: Git ruft eine Stand ab, der genau dazwischen liegt.
pl: Git przywoła stan, który leży dokładnie pośrodku.

source: Git speichert den Dateiinhalt nur ein einziges Mal.
pl: Git zapamięta zawartość pliku wyłącznie jeden raz.

source: Git speichert jeden errechneten SHA1-Wert eines 'Commits' in `.git/logs`.
pl: Git zapamiętuje każdy obliczony klucz SHA1 dla odpowiednich 'commit' w `.git/logs`

source: Git stöbert Umbenennungen und Kopien zwischen aufeinander folgenden Versionen heuristisch auf.
pl: Git poszukuje heurystycznie zmian nazw w następującymch po sobie wersjach kopii.

source: Git tauscht selten Daten direkt zwischen Deinem Projekt und seiner Versionsgeschichte aus.
pl: Git rzadko wymienia dane bezpośrednio między twoim projektem a swoją historią wersji.

source: Git unter Microsoft Windows kann frustrierend sein:
pl: Korzystanie z GIT pod Microsoft Windows może być frustrujące:

source: Git versetzt dich wieder auf einen Stand genau zwischen den bekannten Versionen "good" und "bad" und reduziert so die Möglichkeiten.
pl: Git przeniesie cię znowu do stanu dokładnie pomiędzy znanymi wersjami "good" a "bad" i w ten sposób redukuje możliwości.

source: Git versteht beide Gesichtspunkte.
pl: Git jest wyrozumiały dla oby dwuch stron.

source: Git von Anfang an zu benutzen, ist wie ein Schweizer Taschenmesser mit sich zu tragen, auch wenn damit meistens nur Flaschen geöffnet werden.
pl: Używając git od samego początku, to jak noszenie ze sobą scyzoryka szwajcarskiego, nawet gdy najczęściej posłuży do otwierania butelek.

source: Git war das erste Versionsverwaltungssystem, das ich benutzt habe.
pl: Git był pierwszym systemem kontroli wersji którego używałem.

source: Git wird sich die Dateien im aktuellen Verzeichnis ansehen und sich die Details selbst erarbeiten.
pl: Git przyjży się danym w aktualnym katalogu i odpracuje sam szczegóły.

source: Git wurde geschrieben um schnell zu sein, im Hinblick auf die Größe der Änderungen.
pl: Git został napisany z myślą optymalizacji prędkości działania przy dokonywaniu wielkich zmian.

source: Git würde davon provitieren, einen Null-'Commit' zu definieren: sofort nach dem Erstellen eines 'Repository' wird der 'HEAD' auf eine Zeichenfolge von 20 Null-Bytes gesetzt.
pl: Git zyskałby na zdefiniowaniu tzw 0-'commit' zaraz po zainicjowaniu repozytorium 'HEAD' zostałby ustawiony na 20 bajtow hash

source: Git über SSH, HTTP
pl: Git przez SSH, HTTP

source: Git über alles
pl: Git ponad wszystko

source: Git überwacht immer das ganze Projekt, was normalerweise schon von Vorteil ist.
pl: GIT kontrojuje zawsze całość projektu, co w normalnym wypadku jest zaletą.

source: Git's Geheimnisse scheinen zu einfach.
pl: Tajemnice Gita wydają się być proste.

source: Git's Wurzeln
pl: Korzenie Git

source: GitHub hat eine Schnittstelle, die das erleichtert: Erzeuge deine eigene 'Fork' vom "gitmagic" Projekt, 'pushe' deine Änderungen, dann gib mir Bescheid, deine Änderungen zu 'mergen'.
pl: GitHub posiada interfejs, który to ułatwi: utwórz twój własny 'Fork' projektu "gitmagic", 'push' twoje zmiany i daj mi znać, by je 'mergen'.

source: Globaler Zähler
pl: Licznik globalny

source: Glücklicherweise hat Git eine Abkürzung dafür, die genauso komfortabel ist wie eine Fernbedienung:
pl: Na szczęście GIT posiada na te operacje skrót, który jest tak samo komfortowy jak pilot telewizora:

source: Glücklicherweise ist das Git's Stärke und wohl auch seine Daseinsberechtigung.
pl: Na szczęście jest to silną stroną git i chyba jego racją bytu.

source: Hast Du es zu lange versäumt zu 'comitten'?
pl: Od dłuższego czasu nie pamiętałeś o wykonaniu 'commit'?

source: Hast Du so versessen programmiert, daß Du darüber die Quellcodeverwaltung vergessen hast?
pl: Tak namiętnie programowałeś, że zupełnie zapomniałeś o zarządzeniem kodu źródłowego?

source: Hast du es satt, wie sich ein Projekt entwickelt?
pl: Jeśli nie masz już ochoty patrzeć na kierunek rozwoju w którym poszedł projekt

source: Hast du gerade 'commitet', aber du hättest gerne eine andere Beschreibung eingegeben?
pl: Właśnie wykonałeś 'commit', ale chętnie chciałbyś podać inny opis?

source: Hast du gravierende Änderungen vor?
pl: Masz zamiar dokonania wielu zmian?

source: Hast du schon einmal ein Spiel gespielt, wo beim Drücken einer Taste (``der Chef-Taste''), der Monitor sofort ein Tabellenblatt oder etwas anderes angezeigt hat?
pl: Grales juz kiedys w gre, ktora posiadala przycisk SZEF, po nacisnieciu ktorej monitor od razu pokazywal jakis arkusz kalkulacyjny. albo cos innego?

source: Heutzutage macht es Git dem Anwender schwer versehentlich Daten zu zerstören.
pl: Obecnie git dość dobrze chroni użytkownika przed przypadkowym zniszczeniem danych.

source: Hinzufügen, Löschen, Umbenennen
pl: Dodac, skasowac, zmienic nazwe

source: Hoffentlich stellt Git auf eine bessere Hash Funktion um, bevor die Forschung SHA1 komplett unnütz macht.
pl: Miejmy nadzieję, że GIT przestawi sie na lepszą funkcje hash, zanim badania nad SHA1 zupełnie zrobią go bezużytecznym.

source: Hätte ich mein Projekt fertig gestellt, wäre ich trotzdem bei Git geblieben, denn die Verbesserungen wären zu gering gewesen um den Einsatz eines Eigenbrödler-Systems zu rechtfertigen.
pl: Nawet gdybym zakończył mój projekt, mimo to pozostałbym przy GIT, bo ulepszenia byłyby zbyt minimalne by uzasadnić zastosowanie odosobnionego systemu.

source: Hättest du nur die Funktion während der Entwicklung getestet.
pl: A gdybyś tylko lepiej przetestował ją wcześniej, zanim weszła do wersji produkcyjnej.

source: Ich 'merge' meine eigenen Änderungen und führe eventuell weitere Änderungen durch.
pl: Wykonuję 'merge' moich własnych zmian i przeprowadzam ewentualnie dalsze zmiany.

source: Ich benutze eine Analogie um in die Versionsverwaltung einzuführen.
pl: By wprowadzić w zagadnienie zarządzania wersją, posłużę się pewną analogią.

source: Ich bevorzuge auch C-Programme und 'bash'-Skripte gegenüber Anwendungen wie zum Beispiel Python Skripts: Es gibt weniger Abhängigkeiten und ich bin süchtig nach schellen Ausführungszeiten.
pl: Preferuję również programy C i skrypty bash w opozycji do na przykład Pythona: posiadają mniej zależności, jestem też spragniony szybkiego wykonywania kodu

source: Ich bin erstaunt, dass so viele Leute an der Übersetzung dieser Seiten gearbeitet haben.
pl: Jestem mile zaskoczony, że tak dużo ludzi pracowało nad przetłumaczeniem tych stron.

source: Ich bin schnell in die Anwendung hineingewachsen und betrachtete viele Funktionen als selbstverständlich.
pl: Szybko dorosłem do tej aplikacji i przyjąłem wiele funkcji za oczywiste.

source: Ich dachte darüber nach, wie Git verbessert werden könnte, ging sogar so weit, dass ich meine eigene Git-Ähnliche Anwendung schrieb, allerdings nur als akademische Übungen.
pl: Myślałem też nad tym, jak można by ulepszyć GIT, poszło nawet tak daleko, że napisałem własną aplikacje podobną do GIT, w celu jednak wyłącznie ćwiczeń akademickich.

source: Ich empfehle folgende Schritte um diese Anleitung zu übersetzen, damit meine Skripte einfach eine HTML- und PDF-Version erstellen können.
pl: Aby przetłumaszyć mije HOWTO polecam wykonanie następujących ponniżej kroków, wtedy moje skrypty będą w prosty sposób mogły wygenerować wersje HTML i PDF.

source: Ich habe diese Phänomen aus erster Hand erfahren.
pl: Dowiedziałem się o tym fenomenie z pierwszej ręki.

source: Ich habe einfach vorausgesetzt, dass andere Systeme ähnlich sind: die Auswahl eines Versionsverwaltungssystems sollte nicht anders sein als die Auswahl eines Texteditors oder Internetbrowser.
pl: Wychodziłem też z założenia, że inne systemy są podobne: wybór systemu kontroli wersji nie powinien zbyt bardzo odbiegać od wyboru edytora tekstu, czy przeglądarki internetowej.

source: Ich habe ursprünglich Git gewählt, weil ich gehört habe, dass es die unvorstellbar unüberschaubaren Linux Kernel Quellcodes verwalten kann.
pl: Zdecydowałem się pierwotnie do wyboru GIT, ponieważ słyszałem, że jest w stanie zarządzać tak zawiłym i rozległym projektem jak kod źródłowy Linuxa.

source: Ich hatte noch keinen Grund zu wechseln.
pl: Nie miałem jeszcze powodu do zmiany.

source: Ich musste lernen, wie man Projekte verwaltet, an denen mehrere Entwickler aus aller Welt beteiligt waren.
pl: Musiałem nauczyć się zarządzać projektami, nad którymi zaangażowani byli programiści z całego świata.

source: Ich nehme alles zurück
pl: Wycofuję wszystko co na ten temat powiedziałem.

source: Ich spiele Computerspiele schon fast mein ganzes Leben.
pl: Gram w gry komputerowe przez całe moje życie.

source: Ich vermute, dass ich damit nicht alleine bin und der Vergleich hilft vielleicht dabei die Konzepte einfacher zu erklären und zu verstehen.
pl: Przypuszczam, że nie jestem tu w odosobnieniu, a porównanie to pomoże mi w prosty sposób ten konzept wytłumaczyć i zrozumieć.

source: Ich war geschockt, als ich später gezwungen war ein zentralisiertes System zu benutzen.
pl: Byłem zszokowany, gdy musiałem później korzystać ze scentralizowanego systemu.

source: Ich war versucht, euch hier alle aufzuzählen, aber das könnte Erwartungen in unermesslichem Umfang wecken.
pl: Chciałem was tu wszystkich wyszczegąlnić, mogłoby to jednak wzbudzić oczekiwania w szerokim zakresie.

source: Ich weiß es zu würdigen, dass ich, dank der Bemühungen der oben genannten, einen größeren Leserkreis erreiche.
pl: bardzo doceniam to, że dzięki staraniom tylu wyżej wymienionych osób mam możliwość osiągnąć większy zakres czytelników.

source: Ich werde nicht ins Detail gehen.
pl: Nie będę wchodził w szczegóły.

source: Im Gegensatz dazu habe ich erst als Erwachsener damit begonnen Versionsverwaltungssysteme zu benutzen.
pl: W przeciwieństwie do tego, systemy kontroli wersji zacząłem używać dopiero jako dorosły.

source: Im Gegensatz dazu hält Git seinen Verlauf einfach im `.git` Verzeichnis von Deinem Arbeitsverzeichnis.
pl: W przeciwieństwie do tego, Git posiada kronikę całej swojej historii w podkatalogu .git twojego katalogu roboczego.

source: Im Gegensatz zu den meisten Computerspielen sind sie aber in der Regel dafür ausgelegt sparsam mit dem Speicherplatz umzugehen.
pl: W przeciwieństwie jednak do gier, są one z regóły wszystkie zoptymalizowane pod kątem oszczędności pamięci.

source: Im Gegensatz zu vielen anderen Versionsverwaltungssystemen funktioniert diese Operation offline, es wird nur von der lokalen Festplatte gelesen.
pl: W przeciwieństwie do wielu innych systemów, funkcja ta działa offline, czytane jest tylko z lokalnego dysku.

source: Im letzten Fall zeigt der SHA1-Hash-Wert auf ein 'Tree'-Objekt.
pl: W ostatnim przypadku klucz SHA1 wskazuje na objekt 'tree'.

source: Immerhin sind 'Clone' fast genauso schnell und du kannst mit *cd* anstelle von esoterischen Git Befehlen zwischen ihnen wechseln.
pl: Jakby nie było, polecenia CLONE są prawie tak samo szybkie i możesz po prostu poleceniem *cd* zamiast ezoterycznych poleceń GIT miedzy nimi zmieniać.

source: In Git und anderen verteilten Versionsverwaltungssystemen ist 'clone' die Standardaktion.
pl: W GIT i innych dzielonych systemach zarządzania wersją to CLONE jest standardem.

source: In Herstellungsprozessen muss der zweiter Schritt eines Plans oft auf die Fertigstellung des ersten Schritt warten.
pl: W procesie produkcji czesto drugi krok planu musi czekac na zakonczenie pierwszego

source: In der Git Welt zu bleiben ist etwas bequemer als 'Patch'-Dateien, denn es erspart mir sie in Git 'Commits' zu konvertieren.
pl: Pozostając w świecie Gita jest wygodniejsze niż otrzymywanie patchów, ponieważ zaoszczędza mi to konwertowanie ich do 'commits' Gita.

source: In der Praxis möchtest Du aber das "refs/heads/" entfernen und Fehler ignorieren:
pl: W praktyce chciałbyś raczej usunąć "refs/heads/" i ignorować błędy:

source: In diesem Fall sollte der Quellcode der Firmware in einem Git 'Repository' gehalten werden und die Binärdatei außerhalb des Projekts.
pl: W takim wypadku należałoby trzymać w repozytorium wyłącznie kod źródłowy, a sam plik binarny pora nim.

source: In diesem Fall verwende *git add -i*, dessen Bedienung ist nicht ganz einfach, dafür aber sehr flexibel.
pl: W takim wypadku skorzystaj z *git add -i*, obsługa tego polecenia może nie jest zbyt łatwa, zato jednak bardzo elastyczna.

source: In diesem Fall wollen wir aber mehr Kontrolle, also manipulieren wir den Index.
pl: W tym wypadku chcemy posiadać jednak większą kontrolę, więc manipulujemy index.

source: In diesem Fall, gib folgendes ein:
pl: W tym wypadku użyj komendy:

source: In echter UNIX Sitte erlaubt es Git's Design, dass es auf einfache Weise als Low-Level-Komponente von anderen Programmen benutzt werden kann, wie zum Beispiel grafischen Benutzeroberflächen und Internetanwendungen, alternative Kommandozeilenanwendungen, Patch-Werkzeugen, Import- und Konvertierungswerkzeugen und so weiter.
pl: W prawdziwym świecie UNIX konstrukcja GIT pozwala, iż w prosty sposób, jako komponent niskiego poziomu, może być wykorzystywany przez inne aplikacje, jak na przykład interfejsy graficzne i aplikacje internetowe, alternatywne narzędzia konsoli, narzędzia patchujące, narzędzia pomocne w importowaniu i konwertowaniu i tak dalej.

source: In ein paar Jahren hat vielleicht schon ein ganz normaler Heim-PC ausreichend Rechenleistung um ein Git 'Reopsitory' unbemerkt zu korrumpieren.
pl: Za kilka lat możliwe, że całkiem normalny domowy PC będzie dysponował odpowiednim zasobem mocy obliczeniiowej, by skorumpować niepostrzeżenie repozytorium GIT-

source: In einem Gerichtssaal können Ereignisse aus den Akten gelöscht werden.
pl: W sali sądowej można pewne zdarzenia wykreślić z akt.

source: In einem Git 'Repository' gib ein:
pl: W repozytorium git natomiast podajesz:

source: In einem leeren Verzeichnis:
pl: W pustym katalogu:

source: In einem zentralisierten Versionsverwaltungssystem ist das Bearbeiten der Chronik eine schwierige Angelegenheit und den Administratoren vorbehalten.
pl: W scentralizowanym systemie kontroli wersji praca nad kroniką historii jest skomplikowanym zadaniem i zarezerwowanym głównie dla administratorom.

source: In einer offizielleren Umgebung, wenn Autorennamen und eventuell Signaturen aufgezeichnet werden sollen, erstelle die entsprechenden 'Patches' nach einem bestimmten Punkt durch Eingabe von:
pl: W bardziej oficjalnym środowisku, jeśli nawiska autorów i ich sygnatury powinny również być notowane, tworz 'patch' od pewnego punktu, po wpisaniu:

source: In extremen Fällen trifft das auch auf die grundlegenden Anweisungen zu.
pl: W ekstremalnych przypadkach dotyczy to również poleceń podstawowych.

source: In größeren Projekten, vermeidest Du Datenmüll indem Du nur Änderungen 'bundlest', die in den anderen 'Repositories' fehlen.
pl: W dużych projektach unikniesz śmieci danych, jeśli tylko zrobisz 'bundle' zmian brakujących w innych repozytoriach.

source: In irgendeinem Verzeichnis:
pl: W jakimkolwiek katalogu:

source: In manchen Systemen benötigt der Anwender schon eine Netzwerkverbindung nur um seine eigenen Änderungen zu sehen oder um eine Datei zum Bearbeiten zu öffnen.
pl: W niektórych systemach użytkownik potrzebuje działającej sieci nawet by zobaczyć przez siebie dokonane zmiany, albo by wogóle otworzyć plik do edycji.

source: In unserem Beispiel ist der Dateityp 100644, was bedeutet, dass `rose` eine normale Datei ist und der SHA1-Hash-Wert entspricht dem 'Blob'-Objekt, welches den Inhalt von `rose` enthält.
pl: W naszym przykładzie typ pliku to 100644, co oznacza, że `rose` jest plikiem zwykłym, natomiast klucz SHA1 odpowiada kluczowi SHA1 objektu 'blob' zawierającego zawartość `rose`.
